In [37]:
import pandas as pd
import re

In [54]:
df = {'school_id':['sch1','sch2','sch3'], 'state_code':['c1','c2','c3'], 'subjects':["english maths chemistry","maths english physics","chemistry"]}

In [85]:
df = {'school_id':['sch1','sch2','sch3'], 'state_code':['c1','c2','c3'], 'subjects':["english english maths chemistry","maths english physics","chemistry"]}

In [86]:
df = pd.DataFrame(df)
df

  school_id state_code                         subjects
0      sch1         c1  english english maths chemistry
1      sch2         c2            maths english physics
2      sch3         c3                        chemistry

In [ ]:
df['subjects'].str.split()

In [92]:
unique_subjects = set(df['subjects'].str.split().explode())

In [94]:
df['subjects'].str.split().apply(lambda x: len(set(x)))

0    3
1    3
2    1
Name: subjects, dtype: int64

In [95]:
df['subject_count']  =df['subjects'].str.split().apply(lambda x: len(set(x)))

In [96]:
df

  school_id state_code                         subjects  subject_count
0      sch1         c1  english english maths chemistry              3
1      sch2         c2            maths english physics              3
2      sch3         c3                        chemistry              1

In [73]:
df = df[df['subject_count']>2]

In [74]:
df['state_code'] = df['state_code'].apply(lambda x: re.sub(r'[a-zA-Z0-9]', '', x))

/tmp/ipykernel_338794/4025031740.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['state_code'] = df['state_code'].apply(lambda x: re.sub(r'[a-zA-Z0-9]', '', x))

In [75]:
df_temp = df.assign(subjects=df['subjects'].str.split()).explode('subjects')

In [76]:
df_temp

  school_id state_code   subjects  subject_count
0      sch1               english              4
0      sch1               english              4
0      sch1                 maths              4
0      sch1             chemistry              4
1      sch2                 maths              3
1      sch2               english              3
1      sch2               physics              3

In [77]:
subjects_oi=['english','maths','physics','chemistry']

In [78]:
df_temp = df_temp[df_temp['subjects'].isin(subjects_oi)]

In [79]:
df_temp

  school_id state_code   subjects  subject_count
0      sch1               english              4
0      sch1               english              4
0      sch1                 maths              4
0      sch1             chemistry              4
1      sch2                 maths              3
1      sch2               english              3
1      sch2               physics              3

In [80]:
df_temp = df_temp.groupby(['state_code','subjects']).size().reset_index()

In [81]:
df_temp = df_temp.pivot(index='state_code',columns='subjects',values=0).fillna(0).reset_index()

In [82]:
for col in subjects_oi:
    df_temp[col]=df_temp[col].astype(int)

In [83]:
df = df_temp[['state_code']+subjects_oi]

In [84]:
df

subjects state_code  english  maths  physics  chemistry
0                          3      2        1          1

In [18]:
df.groupby('state_code').agg('english'=,'maths'=,'physics'=,'chemistry')

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (2644931868.py, line 1)